Revit 2027 API
ExporterIFCUtils.SetGlobal3DOriginHandle Method
Note: This API is now obsolete.
 Sets the handle representing the 3D origin.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
[ObsoleteAttribute("This function is deprecated in Revit 2027.  Handles are new created as needed.")]
public static void SetGlobal3DOriginHandle(
	IFCAnyHandle origin
)
<ObsoleteAttribute("This function is deprecated in Revit 2027.  Handles are new created as needed.")>
Public Shared Sub SetGlobal3DOriginHandle (
	origin As IFCAnyHandle
)
public:
[ObsoleteAttribute(L"This function is deprecated in Revit 2027.  Handles are new created as needed.")]
static void SetGlobal3DOriginHandle(
	IFCAnyHandle^ origin
)
[<ObsoleteAttribute("This function is deprecated in Revit 2027.  Handles are new created as needed.")>]
static member SetGlobal3DOriginHandle :
        origin : IFCAnyHandle -> unit
Parameters
origin IFCAnyHandle
 The origin handle.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace